<?php
/** *---------------------------------------
 *  | CjForever
 *  ----------------------------------------
 *
 *  *---------------------------------------
 *  | 作者:  CJForever by: notexpired@163.com
 *  ----------------------------------------
 *
 *  *---------------------------------------
 *  | 版权:  © 2017 <CjForever>  Inc
 *  ----------------------------------------
 *
 *  *---------------------------------------
 *  | 时间:  2017/8/31
 *  ----------------------------------------
 *
 *  *---------------------------------------
 *  | 描述: 这家伙很懒，什么都没有留下
 *  ----------------------------------------
 */
return [
    'modifyInfo' => [
        'avatar'=>[
            'type'=>'jpg,jpeg,gif,png',
            'size'=>1024, // 单位KB
        ],
        'nick'  =>  '[1,20]',    //  昵称长度
        'sex'   =>  '男|女|保密', //  性别
        'age'   =>  '[1,200]',  //   年龄
        'qm'    =>  '[5,80]',   //   签名
    ],
    'sign' => [
        // '亲爱的用户，你好!!!感谢你的注册，你的激活码为f0295f<br />----------非本人操作可忽略----------<br />CZPhp_IT学习网你加入了吗？想学习IT技术吗？想更懂计算机吗？快快加入我们吧，加入CZPhp_IT学习网能为提供IT教程、作业、在线学习、源码分享、与牛人交流、与更多人一起学习，官方网址:http://czphp.cn';
        'getCode' => [
            'title'     =>  'CZ博客',
            'content'   =>  '亲爱的用户，你好!!!感谢你的到来，我们只差一步就成为好伙伴啦，请在注册页面输入验证码:{$code}<br />----------非本人操作可忽略----------<br />来CZ博客学习IT技术、拿源码...你加入了吗？我们的网址:http://czphp.cn/'
        ],
        'signSuccess' => ''
    ]
];

