<?php
namespace source\common;
/** *---------------------------------------
 *  | CjForever
 *  ----------------------------------------
 *
 *  *---------------------------------------
 *  | 作者:  CJForever by: notexpired@163.com
 *  ----------------------------------------
 *
 *  *---------------------------------------
 *  | 版权:  © 2017 <CjForever>  Inc
 *  ----------------------------------------
 *
 *  *---------------------------------------
 *  | 时间:  2017/8/24
 *  ----------------------------------------
 *
 *  *---------------------------------------
 *  | 描述: 这家伙很懒，什么都没有留下
 *  ----------------------------------------
 */

class token {
    /**
     * 获取token
     * @return bool|string
     */
    public static function get(){
        $request = \CZ::$app->request;
        $urlToken  =  $request->get('token');
        $token = \paw::rsaDecrypt($urlToken);
        return $token;
    }



}

