<?php
/** *---------------------------------------
 *  | CjForever
 *  ----------------------------------------
 *
 *  *---------------------------------------
 *  | 作者:  CJForever by: notexpired@163.com
 *  ----------------------------------------
 *
 *  *---------------------------------------
 *  | 版权:  © 2017 <CjForever>  Inc
 *  ----------------------------------------
 *
 *  *---------------------------------------
 *  | 时间:  2017/8/19
 *  ----------------------------------------
 *
 *  *---------------------------------------
 *  | 描述: 这家伙很懒，什么都没有留下
 *  ----------------------------------------
 */

// 头部定义
header('Access-Control-Allow-Origin:*');
ini_set('date.timezone', 'Asia/Shanghai');
// 加载 常量
require_once __DIR__.'/define.php';
// 自动加载
require_once __DIR__.'/loader.php';
// 引入函数库
require_once __DIR__.'/function.php';
// 准备就绪,运行框架了
run::main();

