<?php
/** *---------------------------------------
 *  | CjForever
 *  ----------------------------------------
 *
 *  *---------------------------------------
 *  | 作者:  CJForever by: 544301197@qq.com
 *  ----------------------------------------
 *
 *  *---------------------------------------
 *  | 版权:  © 2017 <CjForever>  Inc
 *  ----------------------------------------
 *
 *  *---------------------------------------
 *  | 时间:  2017/7/27
 *  ----------------------------------------
 *
 *  *---------------------------------------
 *  | 描述: 数据库配置
 *  ----------------------------------------
 */


/**
 * 暂只支持MySQL数据库
 */
return [
    // 服务器地址
    'host'              => 'localhost',
    // 数据库名
    'database'          => 'blog',
    // 用户名
    'username'          => 'root',
    // 密码
    'password'          => 'root',
    // 端口
    'port'              => 3306,
    // 数据库编码默认采用utf8
    'charset'           => 'utf8',
    // 数据库表前缀
    'prefix'            => 'czphp_',
    // 检测数据表是否正确  如:错误，抛出异常
    'checkTable'        => true,
    // 严格检测字段
    'checkField'        => true,
    // 是否记录SQL语句
    'record'            => true,
    // 默认运算符
    'defaultO' => '=',
    // 默认条件
    'defaultC' => 'and',
];
